## <ins>Objective</ins>

<br>
<font size="3">
    
We'll compare pandas **get_dummies** with sklearn **OneHotEncoder**, which one to use in real world to oneHot encoding of categorical variables
    
</font>

In [1]:
## Importing Libraries
import pandas as pd

## Preparing Train and Test dataframes

In [2]:
## Train Data
train_details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
  
# creating a Dataframe object 
df_train = pd.DataFrame(train_details)
df_train

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [3]:
## Test Data
test_details = {
    'Name' : ['Ajay', 'Amit', 'Rajesh', 'Rashmi'],
    'Age' : [20, 21, 22, 23],
    'University' : ['BHU', 'DU', 'DU', 'BHU'],
}
  
# creating a Dataframe object 
df_test = pd.DataFrame(test_details)
df_test

     Name  Age University
0    Ajay   20        BHU
1    Amit   21         DU
2  Rajesh   22         DU
3  Rashmi   23        BHU

## One-Hot Encoding Using Pandas

In [4]:
## On Training Data

df_train_new = pd.get_dummies(df_train, columns=['University'])
df_train_new

        Name  Age  University_BHU  University_DU  University_JNU
0      Ankit   23               1              0               0
1  Aishwarya   21               0              0               1
2    Shaurya   22               0              1               0
3   Shivangi   21               1              0               0

In [5]:
## On Test Data

df_test_new = pd.get_dummies(df_test, columns=['University'])
df_test_new

     Name  Age  University_BHU  University_DU
0    Ajay   20               1              0
1    Amit   21               0              1
2  Rajesh   22               0              1
3  Rashmi   23               1              0

## One-Hot Encoding Using Scikit-learn OneHotEncoder

In [6]:
from sklearn.preprocessing import OneHotEncoder

sklearn_one_hot_encoder = OneHotEncoder()
sklearn_one_hot_encoder.fit(df_train['University'].values.reshape(-1,1))

train_university_one_hot_encoding = sklearn_one_hot_encoder.transform(df_train['University'].values.reshape(-1,1)).toarray()
train_university_one_hot_encoding

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [7]:
## On Test Data

test_university_one_hot_encoding = sklearn_one_hot_encoder.transform(df_test['University'].values.reshape(-1,1)).toarray()
test_university_one_hot_encoding

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

## <ins>Conclusion</ins>

<br>
<font size="3">

As you clearly see we have to use sklearn **OneHotEncoder** as it automatically handled the case where the number of categories in test data is less comapred to training data in a categorical variable. If this won't be handled theen there will be an error while testing the model 
    
</font>